package tech.kitcorp;

public class Main {
    public static void main(String[] args) {
        System.out.println("It's Windows path: \"C:\\Program Files\\Java\\jdk1.7.0\\bin\"");
        System.out.println("It's Java string: \\\"C:\\\\Program Files\\\\Java\\\\jdk1.7.0\\\\bin\\\"");

    }
}

// Вывести на экран следующий текст - две строки:
// It's Windows path: "C:\Program Files\Java\jdk1.7.0\bin"
// It's Java string: \"C:\\Program Files\\Java\\jdk1.7.0\\bin\"

// Подсказка:
// \” – экранирование двойной кавычки;
// \\ – экранирование обратной косой черты (\).

