package tech.kitcorp;

public class Main {
    public static int number1 = 4;
    public static int number2 = 2;


    public static void main(String[] args)
    {
        System.out.println(number1 + number2);
        System.out.println(number1 - number2);
        System.out.println(number1 * number2);
        System.out.println(number1 / number2);
    }
}

// Дана переменная number.
// Напиши программу, которая выводит на экран квадрат этой переменной (number * number).
// Требования:
