package tech.kitcorp;

public class Main {
    public static void main(String[] args) {
        int result = 0;
        for (int i = 1; i<6; i++){
            result = result+i;
            System.out.println(result);

        }

    }
}

// Вывести на экран сумму чисел от 1 до 5 построчно (должно быть 5 строк):
// 1
// 1+2=3
// 1+2+3=6
// ...

// Пример вывода:
// 1
// 3
// 6
// ...
