package tech.kitcorp;

/*
DOB
*/

public class Main {
    public static void main(String[] args)
    {
        String dob = "1983";
        System.out.println(dob);
    }
}

// Написать программу, выводящую на экран год рождения моего друга.

// Требования:
// Программа должна выводить текст.
// Выведенный год должен состоять из 4 цифр.
// Выведенный год должен соответствовать заданию.